In [1]:
import pandas as pd

In [3]:
my_list = ['watermelon','orange','apple']
label = ['fruit#1', 'fruit#2', 'fruit#3']
my_list

['watermelon', 'orange', 'apple']

In [7]:
type(my_list)

list

In [9]:
x = pd.Series(data = my_list, index = label)

In [11]:
x

fruit#1    watermelon
fruit#2        orange
fruit#3         apple
dtype: object

In [13]:
serie = pd.Series([11,15,12,13,14,12,11,11,10,14,16,16,14])
print(serie)

0     11
1     15
2     12
3     13
4     14
5     12
6     11
7     11
8     10
9     14
10    16
11    16
12    14
dtype: int64

In [23]:
serie = pd.Series([11,11,15,12,13,14,12,11,11,10,14,16,16,14], index=["Fred", "Jeanne", "Julie", "Julien", "Chloe", "Alex", "Nicolas", "Alice", "Alice", "Matheo", "Zoe", "Mael", "Catherine", "Ines"])
serie

Fred         11
Jeanne       11
Julie        15
Julien       12
Chloe        13
Alex         14
Nicolas      12
Alice        11
Alice        11
Matheo       10
Zoe          14
Mael         16
Catherine    16
Ines         14
dtype: int64

In [19]:
serie.describe()

count    14.000000
mean     12.857143
std       1.994498
min      10.000000
25%      11.000000
50%      12.500000
75%      14.000000
max      16.000000
dtype: float64

In [25]:
serie["Julien"]

12

In [27]:
serie[["Julien", "Julie", "Matheo"]]

Julien    12
Julie     15
Matheo    10
dtype: int64

In [29]:
serie[3]

C:\Users\Fops\AppData\Local\Temp\ipykernel_23476\374135576.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  serie[3]

12

In [31]:
serie.min()

10

In [33]:
serie.max()

16

In [35]:
serie[serie>12]

Julie        15
Chloe        13
Alex         14
Zoe          14
Mael         16
Catherine    16
Ines         14
dtype: int64

In [39]:
df = pd.DataFrame({
    'Employee ID': [111, 222, 333], 
    'Employee Name': ['Chanel', 'Steve', 'Mitch'], 
    'Salary [$/h]': [35, 29, 38], 
    'Years of Experience': [3, 4, 9]
})
df

   Employee ID Employee Name  Salary [$/h]  Years of Experience
0          111        Chanel            35                    3
1          222         Steve            29                    4
2          333         Mitch            38                    9

In [41]:
df.head()

   Employee ID Employee Name  Salary [$/h]  Years of Experience
0          111        Chanel            35                    3
1          222         Steve            29                    4
2          333         Mitch            38                    9

In [43]:
df.tail(2)

   Employee ID Employee Name  Salary [$/h]  Years of Experience
1          222         Steve            29                    4
2          333         Mitch            38                    9

In [47]:
my_list = ['watermelon','orange','apple']
label = ['fruit#1', 'fruit#2', 'fruit#3']
x = pd.Series(data = my_list, index = label)
x

fruit#1    watermelon
fruit#2        orange
fruit#3         apple
dtype: object

In [49]:
x['fruit#3']

'apple'

In [51]:
x['fruit#2']

'orange'

In [53]:
df = pd.read_html('https://www.livingin-canada.com/house-prices-canada.html')
df

[                                                City  \
 0                                      Vancouver, BC
 1                                       Toronto, Ont
 2                                        Ottawa, Ont
 3                                       Calgary, Alb
 4                                      Montreal, Que
 5                                        Halifax, NS
 6                                       Regina, Sask
 7                                    Fredericton, NB
 8  (adsbygoogle = window.adsbygoogle || []).push(...

                                  Average House Price  \
 0                                         $1,036,000
 1                                           $870,000
 2                                           $479,000
 3                                           $410,000
 4                                           $435,000
 5                                           $331,000
 6                                           $254,000
 7                                           $198,000
 8  (adsbygoogle = window.adsbygoogle || []).push(...

                                      12 Month Change
 0                                           + 2.63 %
 1                                            +10.2 %
 2                                           + 15.4 %
 3                                            – 1.5 %
 4                                            + 9.3 %
 5                                            + 3.6 %
 6                                            – 3.9 %
 7                                            – 4.3 %
 8  (adsbygoogle = window.adsbygoogle || []).push(...  ,
                                              Province  \
 0                                    British Columbia
 1                                             Ontario
 2                                             Alberta
 3                                              Quebec
 4                                            Manitoba
 5                                        Saskatchewan
 6                                         Nova Scotia
 7                                Prince Edward Island
 8                             Newfoundland / Labrador
 9                                       New Brunswick
 10                                   Canadian Average
 11  (adsbygoogle = window.adsbygoogle || []).push(...

                                   Average House Price  \
 0                                            $736,000
 1                                            $594,000
 2                                            $353,000
 3                                            $340,000
 4                                            $295,000
 5                                            $271,000
 6                                            $266,000
 7                                            $243,000
 8                                            $236,000
 9                                            $183,000
 10                                           $488,000
 11  (adsbygoogle = window.adsbygoogle || []).push(...

                                       12 Month Change
 0                                             + 7.6 %
 1                                             – 3.2 %
 2                                             – 7.5 %
 3                                             + 7.6 %
 4                                             – 1.4 %
 5                                             – 3.8 %
 6                                             + 3.5 %
 7                                             + 3.0 %
 8                                             – 1.6 %
 9                                             – 2.2 %
 10                                            – 1.3 %
 11  (adsbygoogle = window.adsbygoogle || []).push(...  ]

In [55]:
df[0]

,City,Average House Price,12 Month Change
0,"Vancouver, BC","$1,036,000",+ 2.63 %
1,"Toronto, Ont","$870,000",+10.2 %
2,"Ottawa, Ont","$479,000",+ 15.4 %
3,"Calgary, Alb","$410,000",– 1.5 %
4,"Montreal, Que","$435,000",+ 9.3 %
5,"Halifax, NS","$331,000",+ 3.6 %
6,"Regina, Sask","$254,000",– 3.9 %
7,"Fredericton, NB","$198,000",– 4.3 %
8,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...

In [57]:
df[1]

,Province,Average House Price,12 Month Change
0,British Columbia,"$736,000",+ 7.6 %
1,Ontario,"$594,000",– 3.2 %
2,Alberta,"$353,000",– 7.5 %
3,Quebec,"$340,000",+ 7.6 %
4,Manitoba,"$295,000",– 1.4 %
5,Saskatchewan,"$271,000",– 3.8 %
6,Nova Scotia,"$266,000",+ 3.5 %
7,Prince Edward Island,"$243,000",+ 3.0 %
8,Newfoundland / Labrador,"$236,000",– 1.6 %
9,New Brunswick,"$183,000",– 2.2 %
10,Canadian Average,"$488,000",– 1.3 %
11,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...

In [59]:
df = pd.DataFrame({
    'Employee ID': [111, 222, 333, 444], 
    'Employee Name': ['Chanel', 'Steve', 'Mitch', 'Bird'], 
    'Salary [$/h]': [35, 29, 38, 20], 
    'Years of Experience': [3, 4, 9, 1]
})
df

   Employee ID Employee Name  Salary [$/h]  Years of Experience
0          111        Chanel            35                    3
1          222         Steve            29                    4
2          333         Mitch            38                    9
3          444          Bird            20                    1

In [61]:
df_new = df[ (df['Years of Experience']>=3)]
df_new

   Employee ID Employee Name  Salary [$/h]  Years of Experience
0          111        Chanel            35                    3
1          222         Steve            29                    4
2          333         Mitch            38                    9

In [63]:
del df['Employee ID']
df

  Employee Name  Salary [$/h]  Years of Experience
0        Chanel            35                    3
1         Steve            29                    4
2         Mitch            38                    9
3          Bird            20                    1

In [69]:
def salary_raise(y):
    return y+2

In [77]:
df['Salary [$/h]'].apply(salary_raise)

0    37
1    31
2    40
3    22
Name: Salary [$/h], dtype: int64

In [79]:
df['Employee Name'].apply(len)

0    6
1    5
2    5
3    4
Name: Employee Name, dtype: int64

In [81]:
df['Years of Experience'].sum()

17

In [83]:
df = pd.DataFrame({
    'Employee ID': [111, 222, 333, 444], 
    'Employee Name': ['Chanel', 'Steve', 'Mitch', 'Bird'], 
    'Salary [$/h]': [35, 29, 38, 20], 
    'Years of Experience': [3, 4, 9, 1]
})
df

   Employee ID Employee Name  Salary [$/h]  Years of Experience
0          111        Chanel            35                    3
1          222         Steve            29                    4
2          333         Mitch            38                    9
3          444          Bird            20                    1

In [85]:
df.sort_values(by='Years of Experience')

   Employee ID Employee Name  Salary [$/h]  Years of Experience
3          444          Bird            20                    1
0          111        Chanel            35                    3
1          222         Steve            29                    4
2          333         Mitch            38                    9

In [87]:
df

   Employee ID Employee Name  Salary [$/h]  Years of Experience
0          111        Chanel            35                    3
1          222         Steve            29                    4
2          333         Mitch            38                    9
3          444          Bird            20                    1

In [89]:
df.sort_values(by='Years of Experience', inplace = True )

In [91]:
df

   Employee ID Employee Name  Salary [$/h]  Years of Experience
3          444          Bird            20                    1
0          111        Chanel            35                    3
1          222         Steve            29                    4
2          333         Mitch            38                    9

In [95]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
index=[0,1,2,3])

In [97]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [99]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
index=[4,5,6,7])

In [101]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [103]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
index=[8,9,10,11])

In [105]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [107]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [111]:
raw_data = {
        'Employeee ID': ['1', '2', '3', '4', '5'],
        'first name': ['Diana', 'Cynthia', 'Shep', 'Ryan', 'Allen'],
        'lats name': ['Bouchard', 'Ali', 'Rob', 'Mitch', 'Steve']}
df_Engineering_dept = pd.DataFrame(raw_data, columns = ['Employee ID', 'first name', 'last name'])
df_Engineering_dept

  Employee ID first name last name
0         NaN      Diana       NaN
1         NaN    Cynthia       NaN
2         NaN       Shep       NaN
3         NaN       Ryan       NaN
4         NaN      Allen       NaN

In [113]:
raw_data = {
        'Employeee ID': ['6', '7', '8', '9', '10'],
        'first name': ['Bill', 'Dina', 'Sarah', 'Heather', 'Holly'],
        'lats name': ['Christian', 'Mo', 'Steve', 'Bob', 'Michelle']}
df_Finance_dept = pd.DataFrame(raw_data, columns = ['Employee ID', 'first name', 'last name'])
df_Finance_dept

  Employee ID first name last name
0         NaN       Bill       NaN
1         NaN       Dina       NaN
2         NaN      Sarah       NaN
3         NaN    Heather       NaN
4         NaN      Holly       NaN

In [121]:
raw_data = {
        'Employeee ID': ['1', '2', '3', '4', '5', '6', '7', '8', '9'],
        'Salary [$/hour]': [25, 35, 45, 48, 49, 32, 33, 34, 23]}
df_salary = pd.DataFrame(raw_data, columns = ['Employee ID','Salary [$/hour]'])
df_salary

  Employee ID  Salary [$/hour]
0         NaN               25
1         NaN               35
2         NaN               45
3         NaN               48
4         NaN               49
5         NaN               32
6         NaN               33
7         NaN               34
8         NaN               23

In [123]:
df_all = pd.concat([df_Engineering_dept, df_Finance_dept)
df_all

SyntaxError: invalid syntax. Maybe you meant '==' or ':=' instead of '='? (4128603643.py, line 1)

In [125]:
df_all_2 = pd.concat([df_Engineering_dept, df_Finance_dept, axis = 1])
df_all_2

SyntaxError: invalid syntax. Maybe you meant '==' or ':=' instead of '='? (4292352943.py, line 1)

In [ ]:
pd.merge(df_all, df_salary, on='Employee ID')